test/jmeter/results/load-test-report/statistics.json
{
  "TG4 - GET /admin/vehicles" : {
    "transaction" : "TG4 - GET /admin/vehicles",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 276.0,
    "medianResTime" : 276.0,
    "minResTime" : 276.0,
    "maxResTime" : 276.0,
    "pct1ResTime" : 276.0,
    "pct2ResTime" : 276.0,
    "pct3ResTime" : 276.0,
    "throughput" : 3.6231884057971016,
    "receivedKBytesPerSec" : 14.446756114130434,
    "sentKBytesPerSec" : 0.0
  },
  "TG4 - GET /admin/users" : {
    "transaction" : "TG4 - GET /admin/users",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 175.0,
    "medianResTime" : 175.0,
    "minResTime" : 175.0,
    "maxResTime" : 175.0,
    "pct1ResTime" : 175.0,
    "pct2ResTime" : 175.0,
    "pct3ResTime" : 175.0,
    "throughput" : 5.714285714285714,
    "receivedKBytesPerSec" : 18.989955357142858,
    "sentKBytesPerSec" : 0.0
  },
  "TG1 - POST /bookings" : {
    "transaction" : "TG1 - POST /bookings",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 729.7800000000001,
    "medianResTime" : 637.0,
    "minResTime" : 413.0,
    "maxResTime" : 1906.0,
    "pct1ResTime" : 1251.7999999999997,
    "pct2ResTime" : 1510.8999999999985,
    "pct3ResTime" : 1906.0,
    "throughput" : 1.705378764623623,
    "receivedKBytesPerSec" : 2.7900929218254373,
    "sentKBytesPerSec" : 0.0
  },
  "TG1 - GET /bookings/:bookingId" : {
    "transaction" : "TG1 - GET /bookings/:bookingId",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 286.40000000000003,
    "medianResTime" : 207.5,
    "minResTime" : 141.0,
    "maxResTime" : 1087.0,
    "pct1ResTime" : 714.8,
    "pct2ResTime" : 812.5999999999993,
    "pct3ResTime" : 1087.0,
    "throughput" : 1.7340639522785601,
    "receivedKBytesPerSec" : 3.2552986491641813,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - GET /payments/:paymentId" : {
    "transaction" : "TG3 - GET /payments/:paymentId",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 307.3400000000001,
    "medianResTime" : 310.5,
    "minResTime" : 168.0,
    "maxResTime" : 585.0,
    "pct1ResTime" : 456.79999999999995,
    "pct2ResTime" : 521.4999999999997,
    "pct3ResTime" : 585.0,
    "throughput" : 1.6611295681063123,
    "receivedKBytesPerSec" : 3.2608752076411958,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - GET /payments/by-booking" : {
    "transaction" : "TG3 - GET /payments/by-booking",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 226.1,
    "medianResTime" : 204.5,
    "minResTime" : 119.0,
    "maxResTime" : 462.0,
    "pct1ResTime" : 354.9,
    "pct2ResTime" : 403.94999999999976,
    "pct3ResTime" : 462.0,
    "throughput" : 1.6585398215411151,
    "receivedKBytesPerSec" : 1.162986263143928,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - PATCH /notifications/read-all" : {
    "transaction" : "TG3 - PATCH /notifications/read-all",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 304.76,
    "medianResTime" : 303.0,
    "minResTime" : 148.0,
    "maxResTime" : 498.0,
    "pct1ResTime" : 449.4,
    "pct2ResTime" : 468.04999999999995,
    "pct3ResTime" : 498.0,
    "throughput" : 1.6485328058028355,
    "receivedKBytesPerSec" : 0.49101807204088366,
    "sentKBytesPerSec" : 0.0
  },
  "TG2 - GET /owner/bookings?status=PENDING" : {
    "transaction" : "TG2 - GET /owner/bookings?status=PENDING",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 371.76,
    "medianResTime" : 328.0,
    "minResTime" : 187.0,
    "maxResTime" : 1160.0,
    "pct1ResTime" : 555.1999999999999,
    "pct2ResTime" : 737.3999999999996,
    "pct3ResTime" : 1160.0,
    "throughput" : 1.6588699777711424,
    "receivedKBytesPerSec" : 808.0938858199795,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - GET /notifications" : {
    "transaction" : "TG3 - GET /notifications",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 217.07999999999998,
    "medianResTime" : 199.0,
    "minResTime" : 115.0,
    "maxResTime" : 415.0,
    "pct1ResTime" : 325.8,
    "pct2ResTime" : 382.4999999999999,
    "pct3ResTime" : 415.0,
    "throughput" : 1.6557936218829685,
    "receivedKBytesPerSec" : 3.1883082342616818,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - GET /reviews/trust-score/:renterId" : {
    "transaction" : "TG3 - GET /reviews/trust-score/:renterId",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 512.9799999999999,
    "medianResTime" : 520.0,
    "minResTime" : 318.0,
    "maxResTime" : 949.0,
    "pct1ResTime" : 701.7,
    "pct2ResTime" : 757.6999999999997,
    "pct3ResTime" : 949.0,
    "throughput" : 1.6377333770062235,
    "receivedKBytesPerSec" : 0.8956354405502783,
    "sentKBytesPerSec" : 0.0
  },
  "TG1 - GET /bookings (my-bookings)" : {
    "transaction" : "TG1 - GET /bookings (my-bookings)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 242.5,
    "medianResTime" : 209.0,
    "minResTime" : 140.0,
    "maxResTime" : 799.0,
    "pct1ResTime" : 290.3,
    "pct2ResTime" : 671.3499999999993,
    "pct3ResTime" : 799.0,
    "throughput" : 1.7550633577872161,
    "receivedKBytesPerSec" : 22.98121780555653,
    "sentKBytesPerSec" : 0.0
  },
  "TG1 - POST /auth/login (Renter)" : {
    "transaction" : "TG1 - POST /auth/login (Renter)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 316.8599999999999,
    "medianResTime" : 235.5,
    "minResTime" : 99.0,
    "maxResTime" : 1488.0,
    "pct1ResTime" : 708.0,
    "pct2ResTime" : 1024.5499999999988,
    "pct3ResTime" : 1488.0,
    "throughput" : 1.6850903208411971,
    "receivedKBytesPerSec" : 1.4991379709827446,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - GET /reviews/vehicle/:vehicleID" : {
    "transaction" : "TG3 - GET /reviews/vehicle/:vehicleID",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.46,
    "medianResTime" : 139.5,
    "minResTime" : 75.0,
    "maxResTime" : 437.0,
    "pct1ResTime" : 266.09999999999997,
    "pct2ResTime" : 302.84999999999985,
    "pct3ResTime" : 437.0,
    "throughput" : 1.6640042598509053,
    "receivedKBytesPerSec" : 0.4696262022430778,
    "sentKBytesPerSec" : 0.0
  },
  "TG4 - GET /admin/dashboard" : {
    "transaction" : "TG4 - GET /admin/dashboard",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 737.0,
    "medianResTime" : 737.0,
    "minResTime" : 737.0,
    "maxResTime" : 737.0,
    "pct1ResTime" : 737.0,
    "pct2ResTime" : 737.0,
    "pct3ResTime" : 737.0,
    "throughput" : 1.3568521031207597,
    "receivedKBytesPerSec" : 4.069231258480325,
    "sentKBytesPerSec" : 0.0
  },
  "TG2 - POST /auth/login (Owner)" : {
    "transaction" : "TG2 - POST /auth/login (Owner)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 260.4200000000001,
    "medianResTime" : 264.0,
    "minResTime" : 101.0,
    "maxResTime" : 475.0,
    "pct1ResTime" : 357.0,
    "pct2ResTime" : 427.4999999999997,
    "pct3ResTime" : 475.0,
    "throughput" : 1.6901598891255112,
    "receivedKBytesPerSec" : 1.5251052124530982,
    "sentKBytesPerSec" : 0.0
  },
  "TG2 - GET /owner/bookings" : {
    "transaction" : "TG2 - GET /owner/bookings",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 464.1800000000001,
    "medianResTime" : 417.5,
    "minResTime" : 280.0,
    "maxResTime" : 1049.0,
    "pct1ResTime" : 682.4999999999999,
    "pct2ResTime" : 896.35,
    "pct3ResTime" : 1049.0,
    "throughput" : 1.6948003525184734,
    "receivedKBytesPerSec" : 1131.0344160989087,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - POST /payments" : {
    "transaction" : "TG3 - POST /payments",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 364.58,
    "medianResTime" : 369.0,
    "minResTime" : 154.0,
    "maxResTime" : 550.0,
    "pct1ResTime" : 508.29999999999995,
    "pct2ResTime" : 529.8,
    "pct3ResTime" : 550.0,
    "throughput" : 1.6631740012640122,
    "receivedKBytesPerSec" : 1.1743567674550113,
    "sentKBytesPerSec" : 0.0
  },
  "TG1 - GET /vehicles/:vehicleID" : {
    "transaction" : "TG1 - GET /vehicles/:vehicleID",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 191.78000000000003,
    "medianResTime" : 139.0,
    "minResTime" : 78.0,
    "maxResTime" : 1090.0,
    "pct1ResTime" : 454.4,
    "pct2ResTime" : 546.5499999999996,
    "pct3ResTime" : 1090.0,
    "throughput" : 1.7448352875488553,
    "receivedKBytesPerSec" : 2.0128992401242325,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - POST /auth/login (Renter)" : {
    "transaction" : "TG3 - POST /auth/login (Renter)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 263.74000000000007,
    "medianResTime" : 269.0,
    "minResTime" : 100.0,
    "maxResTime" : 463.0,
    "pct1ResTime" : 374.6,
    "pct2ResTime" : 422.19999999999976,
    "pct3ResTime" : 463.0,
    "throughput" : 1.6796560064498791,
    "receivedKBytesPerSec" : 1.4943033416756248,
    "sentKBytesPerSec" : 0.0
  },
  "TG3 - GET /bookings?status=CONFIRMED" : {
    "transaction" : "TG3 - GET /bookings?status=CONFIRMED",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 232.96000000000006,
    "medianResTime" : 216.5,
    "minResTime" : 115.0,
    "maxResTime" : 423.0,
    "pct1ResTime" : 356.0,
    "pct2ResTime" : 407.4,
    "pct3ResTime" : 423.0,
    "throughput" : 1.678810059429876,
    "receivedKBytesPerSec" : 6.63038163549676,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1005,
    "errorCount" : 17,
    "errorPct" : 1.6915423,
    "meanResTime" : 313.1552238805965,
    "medianResTime" : 257.0,
    "minResTime" : 68.0,
    "maxResTime" : 1906.0,
    "pct1ResTime" : 564.8,
    "pct2ResTime" : 688.0999999999998,
    "pct3ResTime" : 1089.8199999999997,
    "throughput" : 10.48086850420799,
    "receivedKBytesPerSec" : 649.4029005054022,
    "sentKBytesPerSec" : 0.0
  },
  "TG4 - POST /auth/login (Admin)" : {
    "transaction" : "TG4 - POST /auth/login (Admin)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 223.0,
    "medianResTime" : 223.0,
    "minResTime" : 223.0,
    "maxResTime" : 223.0,
    "pct1ResTime" : 223.0,
    "pct2ResTime" : 223.0,
    "pct3ResTime" : 223.0,
    "throughput" : 4.484304932735426,
    "receivedKBytesPerSec" : 4.0025924887892375,
    "sentKBytesPerSec" : 0.0
  },
  "TG2 - PATCH /owner/bookings/:id/approve" : {
    "transaction" : "TG2 - PATCH /owner/bookings/:id/approve",
    "sampleCount" : 50,
    "errorCount" : 17,
    "errorPct" : 34.0,
    "meanResTime" : 440.04,
    "medianResTime" : 543.0,
    "minResTime" : 128.0,
    "maxResTime" : 770.0,
    "pct1ResTime" : 630.0,
    "pct2ResTime" : 695.0999999999997,
    "pct3ResTime" : 770.0,
    "throughput" : 1.6733601070950468,
    "receivedKBytesPerSec" : 2.0439832245649265,
    "sentKBytesPerSec" : 0.0
  },
  "TG4 - GET /admin/reports/top-vehicles" : {
    "transaction" : "TG4 - GET /admin/reports/top-vehicles",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 194.0,
    "medianResTime" : 194.0,
    "minResTime" : 194.0,
    "maxResTime" : 194.0,
    "pct1ResTime" : 194.0,
    "pct2ResTime" : 194.0,
    "pct3ResTime" : 194.0,
    "throughput" : 5.154639175257732,
    "receivedKBytesPerSec" : 1.6057909149484535,
    "sentKBytesPerSec" : 0.0
  },
  "TG1 - GET /vehicles/available" : {
    "transaction" : "TG1 - GET /vehicles/available",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 206.26000000000005,
    "medianResTime" : 146.0,
    "minResTime" : 68.0,
    "maxResTime" : 824.0,
    "pct1ResTime" : 442.19999999999993,
    "pct2ResTime" : 586.0999999999996,
    "pct3ResTime" : 824.0,
    "throughput" : 1.7464198393293748,
    "receivedKBytesPerSec" : 30.229777004016768,
    "sentKBytesPerSec" : 0.0
  },
  "TG2 - GET /vehicles/my-vehicles" : {
    "transaction" : "TG2 - GET /vehicles/my-vehicles",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 164.33999999999997,
    "medianResTime" : 145.0,
    "minResTime" : 88.0,
    "maxResTime" : 390.0,
    "pct1ResTime" : 245.7,
    "pct2ResTime" : 289.8499999999997,
    "pct3ResTime" : 390.0,
    "throughput" : 1.692219176227705,
    "receivedKBytesPerSec" : 69.96433912495347,
    "sentKBytesPerSec" : 0.0
  }
}